/**
 * Created by Maple on 8/7/15.
 */

/**
 * 游戏通用枚举都放这
 */
var GENDER = {
    MALE: 1,
    FEMALE: 2,
};

var DIRECTIONS = {
    UP: 1,
    LEFT: 2,
    DOWN: 3,
    RIGHT: 4,
};

// 属性
var PROPERTIES = {
    NORMAL: 1,      // 普通
    FIGHTING: 2,    // 格斗
    FLYING: 3,      // 飞行
    POISON: 4,      // 毒
    GROUND: 5,      // 地
    ROCK: 6,        // 岩
    BUG: 7,         // 虫
    GHOST: 8,       // 鬼
    STEEL: 9,       // 钢
    FIRE: 10,       // 火
    WATER: 11,      // 水
    GRASS: 12,      // 草
    ELECTRIC: 13,   // 电
    PSYCHIC: 14,    // 超能
    ICE: 15,        // 冰
    DRAGON: 16,     // 龙
    DARK: 17,       // 恶
};

// 属性名称
var PROPERTY_NAMES = {
    1: "普通",
    2: "格斗",
    3: "飞行",
    4: "毒",
    5: "地",
    6: "岩",
    7: "虫",
    8: "鬼",
    9: "钢",
    10: "火",
    11: "水",
    12: "草",
    13: "电",
    14: "超能",
    15: "冰",
    16: "龙",
    17: "恶",
};

// 属性克制字典
var PROPERTY_MULTIPLIER = {
    1: { 1: 1, 2: 1, 3: 1, 4: 1, 5: 1, 6: 0.5, 7: 1, 8: 0, 9: 0.5, 10: 1, 11: 1, 12: 1, 13: 1, 14: 1, 15: 1, 16: 1, 17: 1 },
    2: { 1: 2, 2: 1, 3: 0.5, 4: 0.5, 5: 1, 6: 2, 7: 0.5, 8: 0, 9: 2, 10: 1, 11: 1, 12: 1, 13: 1, 14: 0.5, 15: 2, 16: 1, 17: 2 },
    3: { 1: 1, 2: 1, 3: 1, 4: 1, 5: 1, 6: 0.5, 7: 2, 8: 1, 9: 0.5, 10: 1, 11: 1, 12: 2, 13: 0.5, 14: 1, 15: 1, 16: 1, 17: 1 },
    4: { 1: 1, 2: 1, 3: 1, 4: 0.5, 5: 0.5, 6: 0.5, 7: 1, 8: 0.5, 9: 0, 10: 1, 11: 1, 12: 2, 13: 1, 14: 1, 15: 1, 16: 1, 17: 1 },
    5: { 1: 1, 2: 1, 3: 0, 4: 2, 5: 1, 6: 2, 7: 0.5, 8: 1, 9: 2, 10: 2, 11: 1, 12: 0.5, 13: 2, 14: 1, 15: 1, 16: 1, 17: 1 },
    6: { 1: 1, 2: 0.5, 3: 2, 4: 1, 5: 0.5, 6: 1, 7: 2, 8: 1, 9: 0.5, 10: 2, 11: 1, 12: 1, 13: 1, 14: 1, 15: 2, 16: 1, 17: 1 },
    7: { 1: 1, 2: 0.5, 3: 0.5, 4: 0.5, 5: 1, 6: 1, 7: 1, 8: 0.5, 9: 0.5, 10: 0.5, 11: 1, 12: 2, 13: 1, 14: 2, 15: 1, 16: 1, 17: 2 },
    8: { 1: 0, 2: 1, 3: 1, 4: 1, 5: 1, 6: 1, 7: 1, 8: 2, 9: 0.5, 10: 1, 11: 1, 12: 1, 13: 1, 14: 2, 15: 1, 16: 1, 17: 0.5 },
    9: { 1: 1, 2: 1, 3: 1, 4: 1, 5: 1, 6: 2, 7: 1, 8: 1, 9: 0.5, 10: 0.5, 11: 0.5, 12: 1, 13: 0.5, 14: 1, 15: 2, 16: 1, 17: 1 },
    10: { 1: 1, 2: 1, 3: 1, 4: 1, 5: 1, 6: 0.5, 7: 2, 8: 1, 9: 2, 10: 0.5, 11: 0.5, 12: 2, 13: 1, 14: 1, 15: 2, 16: 0.5, 17: 1 },
    11: { 1: 1, 2: 1, 3: 1, 4: 1, 5: 2, 6: 2, 7: 1, 8: 1, 9: 1, 10: 2, 11: 0.5, 12: 0.5, 13: 1, 14: 1, 15: 1, 16: 0.5, 17: 1 },
    12: { 1: 1, 2: 1, 3: 0.5, 4: 0.5, 5: 2, 6: 2, 7: 0.5, 8: 1, 9: 0.5, 10: 0.5, 11: 2, 12: 0.5, 13: 1, 14: 1, 15: 1, 16: 0.5, 17: 1 },
    13: { 1: 1, 2: 1, 3: 2, 4: 1, 5: 0, 6: 1, 7: 1, 8: 1, 9: 1, 10: 1, 11: 2, 12: 0.5, 13: 0.5, 14: 1, 15: 1, 16: 0.5, 17: 1 },
    14: { 1: 1, 2: 2, 3: 1, 4: 2, 5: 1, 6: 1, 7: 1, 8: 1, 9: 0.5, 10: 1, 11: 1, 12: 1, 13: 1, 14: 0.5, 15: 1, 16: 1, 17: 0 },
    15: { 1: 1, 2: 1, 3: 2, 4: 1, 5: 2, 6: 2, 7: 1, 8: 1, 9: 0.5, 10: 0.5, 11: 0.5, 12: 2, 13: 1, 14: 1, 15: 0.5, 16: 2, 17: 1 },
    16: { 1: 1, 2: 1, 3: 1, 4: 1, 5: 1, 6: 1, 7: 1, 8: 1, 9: 0.5, 10: 1, 11: 1, 12: 1, 13: 1, 14: 1, 15: 1, 16: 2, 17: 1 },
    17: { 1: 1, 2: 0.5, 3: 1, 4: 1, 5: 1, 6: 1, 7: 1, 8: 2, 9: 0.5, 10: 1, 11: 1, 12: 1, 13: 1, 14: 2, 15: 1, 16: 1, 17: 0.5 },
};

// 宠物状态
var POKEMON_STATES = {
    NORMAL: 0,  // 正常
    POISON: 1,  // 中毒
    SLEEP: 2,   // 睡眠
    PALSY: 3,   // 麻痹
    BURNED: 4,  // 烧伤
    FROZEN: 5,  // 冰冻
    DEAD: 6,    // 濒死
};

// 宠物状态名称
var POKEMON_STATE_NAMES = {
    1: "中毒",
    2: "睡着",
    3: "麻痹",
    4: "烧伤",
    5: "冻结",
};

// 宠物性格
var POKEMON_PERSONALITIES = {
    HARDY: 0,		// 实干
    DOCILE: 1,		// 坦率
    SERIOUS: 2,	    // 认真
    BASHFUL: 3,	    // 害羞
    QUIRKY: 4,		// 浮躁
    LONELY: 5,		// 孤僻
    ADAMANT: 6,	    // 固执
    NAUGHTY: 7,	    // 调皮
    BRAVE: 8,		// 勇敢
    BOLD: 9,		// 大胆
    IMPISH: 10,	    // 淘气
    LAX: 11,		// 无虑
    RELAXED: 12,	// 悠闲
    MODEST: 13,	    // 保守
    MILD: 14,		// 稳重
    RASH: 15,		// 马虎
    QUIET: 16,		// 冷静
    CALM: 17,		// 沉着
    GENTLE: 18,	    // 温顺
    CAREFUL: 19,	// 慎重
    SASSY: 20,		// 狂妄
    TIMID: 21,		// 胆小
    HASTY: 22,		// 急躁
    JOLLY: 23,		// 开朗
    NAIVE: 24,		// 天真
};

// 性格名称
var PERSONALITY_NAMES = {
    0: "实干",
    1: "坦率",
    2: "认真",
    3: "害羞",
    4: "浮躁",
    5: "孤僻",
    6: "固执",
    7: "调皮",
    8: "勇敢",
    9: "大胆",
    10: "淘气",
    11: "无虑",
    12: "悠闲",
    13: "保守",
    14: "稳重",
    15: "马虎",
    16: "冷静",
    17: "沉着",
    18: "温顺",
    19: "慎重",
    20: "狂妄",
    21: "胆小",
    22: "急躁",
    23: "开朗",
    24: "天真",
};

// 技能类型
var SKILL_TYPES = {
    PHYSICAL: 1,		// 物理
    SPECIAL: 2,		// 特殊
    VARIATION: 3,		// 变化
};

// 技能目标类型
var SKILL_TARGET_TYPES = {
    SINGLE_ENEMY: 1,	// 敌方单体
    ALL_ENEMIES: 2,	    // 敌方全体
    SELF: 3,			// 自身
    EXCEPT_SELF: 4,	    // 自身以外
    RANDOM_ENEMY: 5,	// 敌方随机
    SELF_FIELD: 6,		// 己方场地
    ENEMY_FIELD: 7,	    // 敌方场地
    ALL_FIELD: 8,		// 全场场地
    FRIEND: 9,			// 队友
    WAITING: 10,		// 待机
    UNKNOWN: 11,		// 不定
    ANY: 12,			// 任选
};

// 战斗状态
var BATTLE_STATES = {
    NORMAL: 0,          // 正常
    CONFUSED: 1,		// 混乱
    SCARED: 2,			// 害怕
    ATTRACTED: 3,		// 着迷
    BOUND: 4,			// 束缚
    TIRED: 5,			// 无法动弹
};

// 战斗状态名称
var BATTLE_STATE_SUFFIX = {
    1: "混乱了",
    2: "害怕了",
    3: "着迷了",
    4: "受到了捆绑",
    5: "无法动弹",
};

var BATTLE_STATE_NAMES = {
    1: "混乱",
    3: "着迷",
    4: "捆绑",
};

// 战斗行为
var BATTLE_BEHAVIORS = {
    BATTLE: 1,      // 战斗
    CHANGE_POKEMON: 2,  // 更换精灵
    USE_ITEM: 3,    // 使用道具
    ESCAPE: 4,      // 逃跑
};

// 战斗场地buff
var FIELD_BUFF = {
    NO_ABNORMAL_STATE: 1,  // 不会陷入异常状态(不包括战斗状态和濒死)
};

var FIELD_BUFF_TEXT = {
    1: "获得了神秘的守护力量",
}